const demo = `「天は人の上に人を造らず人の下に人を造らず」と言えり。されば天より人を生ずるには、万人は万人みな同じ位にして、生まれながら貴賤《きせん》上下の差別なく、万物の霊たる身と心との働きをもって天地の間にあるよろずの物を資《と》り、もって衣食住の用を達し、自由自在、互いに人の妨げをなさずしておのおの安楽にこの世を渡らしめ給うの趣意なり。されども今、広くこの人間世界を見渡すに、かしこき人あり、おろかなる人あり、貧しきもあり、富めるもあり、貴人もあり、下人もありて、その有様雲と泥《どろ》との相違あるに似たるはなんぞや。その次第はなはだ明らかなり。『実語教《じつごきょう》』に、「人学ばざれば智なし、智なき者は愚人なり」とあり。されば賢人と愚人との別は学ぶと学ばざるとによりてできるものなり。また世の中にむずかしき仕事もあり、やすき仕事もあり。そのむずかしき仕事をする者を身分重き人と名づけ、やすき仕事をする者を身分軽き人という。すべて心を用い、心配する仕事はむずかしくして、手足を用うる力役《りきえき》はやすし。ゆえに医者、学者、政府の役人、または大なる商売をする町人、あまたの奉公人を召し使う大百姓などは、身分重くして貴き者と言うべし。`;

// insert demo text
$('.demo, .demo2').html(demo);
$('.demo2').prepend($('<figure><img src="http://lorempixel.com/180/120" alt=""/><figcaption>キャプション</figcaption></figure>'));

// run jquery.yakumono
$('.js-yakumono-1').yakumono({
  isTsumegumi: true
});

$('.js-yakumono-2').yakumono({
  isBetagumi: true,
  betagumiCenter: true
});

$('.js-yakumono-3').yakumono({
  isBetagumi: true,
  isTategumi: true,
  useJisage: true
});
